import Vue from 'vue'

var app = new Vue({
    el:'#main-container',
    data:{
        title:"将进酒",
        content:"<p>君不见黄河之水天上来，奔流到海不复回。 </p> <p>君不见高堂明镜悲白发，朝如青丝暮成雪。 </p> <p>人生得意须尽欢，莫使金樽空对月。 </p> <p>天生我材必有用，千金散尽还复来。 </p> <p>烹羊宰牛且为乐，会须一饮三百杯。 </p> <p>岑夫子，丹丘生，将进酒，杯莫停。 </p> <p>与君歌一曲，请君为我倾耳听。 </p> <p>钟鼓馔玉不足贵，但愿长醉不复醒。 </p> <p>古来圣贤皆寂寞，惟有饮者留其名。 </p> <p>陈王昔时宴平乐，斗酒十千恣欢谑。 </p> <p>主人何为言少钱，径须沽取对君酌。 </p> <p>五花马、千金裘， 呼儿将出换美酒，与尔同销万古愁。</p>",
        description:"《将进酒》是唐代大诗人李白沿用乐府古题创作的一首诗。 此诗为李白长安放还以后所作，思想内容非常深沉， 艺术表现非常成熟，在同题作品中影响最大。 诗人豪饮高歌，借酒消愁，抒发了忧愤深广的人生感慨。 诗中交织着失望与自信、悲愤与抗争的情怀， 体现出强烈的豪纵狂放的个性。全诗情感饱满， 无论喜怒哀乐，其奔涌迸发均如江河流泻，不可遏止， 且起伏跌宕，变化剧烈；在手法上多用夸张， 且往往以巨额数量词进行修饰， 既表现出诗人豪迈洒脱的情怀， 又使诗作本身显得笔墨酣畅，抒情有力； 在结构上大开大阖，充分体现了李白七言歌行的特色。",
        bg_img:require("../img/bg-将进酒.jpg"),
    }
})