import Vue from 'vue'

var app = new Vue({
    el:'#main-container',
    data:{
        title:"青玉案·元夕",
        content:"<p>东风夜放花千树，</p><p>更吹落，星如雨。</p><p>宝马雕车香满路。</p><p>凤箫声动，玉壶光转，</p><p>一夜鱼龙舞。</p><p>蛾儿雪柳黄金缕，</p><p>笑语盈盈暗香去。</p><p>众里寻他千百度，</p><p>蓦然回首，那人却在，</p><p>灯火阑珊处。</p>",
        description:"古代词人写上元灯节的词，不计其数，辛弃疾的这一首，却没有人认为可有可无，因此也可以称作是豪杰了。然而究其实际，上阕除了渲染一片热闹的盛况外，并无什么独特之处。作者把火树写成与固定的灯彩，把“星雨”写成流动的烟火。若说好，就好在想象：东风还未催开百花，却先吹放了元宵节的火树银花。它不但吹开地上的灯花，而且还从天上吹落了如雨的彩星——燃放的烟火，先冲上云霄，而后自空中而落，好似陨星雨。然后写车马、鼓乐、灯月交辉的人间仙境——“玉壶”，写那民间艺人们载歌载舞、鱼龙漫衍的“社火”百戏，极为繁华热闹，令人目不暇接。其间的“宝”也，“雕”也“凤”也，“玉”也，种种丽字 ，只是为了给那灯宵的气氛来传神来写境，大概那境界本非笔墨所能传写，幸亏还有这些美好的字眼，聊为助意而已。",
        bg_img:require("../img/青玉案·元夕.jpg"),
    }
})