import Vue from 'vue'

var app = new Vue({
    el:'#main-container',
    data:{
        title:"浣溪沙",
        content:"<p>髻子伤春慵更梳，</p><p>晚风庭院落梅初。</p><p>淡云来往月疏疏。</p><p>玉鸭熏炉闲瑞脑，</p><p>朱樱斗帐掩流苏。</p><p>遗犀还解辟寒无？</p>",
        description:"词的起句，开门见山，点明伤春的题旨 。《诗经·伯兮 》云：“自伯之东，首如飞蓬。岂无膏沐，谁适为容？”同这里的“髻子伤春懒更梳”说的是一个意思 。其时词人盖结錞未久，丈夫赵明诚负笈出游，丢下她空房独，寂寞无聊，以至连头发也懒得梳理。此词自第二句起至结句止，基本上遵循了写景宜显、写情宜隐这一创作原则。“晚风庭院落梅初”，是从近处落笔，点时间 ，写环境，寓感情。“落梅初”，既梅花开始飘落 。深沉庭院，晚风料峭，梅残花落，境极凄凉，一种伤春情绪，已在环境的渲染中流露出来 。“淡云”一句被誉为清丽之句”。（见陈廷焯《云韶集 》）词笔引向远方，写词人仰视天空，只见月亮从云缝中时出时没，洒下稀疏的月色。“来往”二字，状云气之飘浮，极为真切 。“疏疏”二字为叠字，富于音韵之美，用以表现云缝中忽隐忽显的月光，也恰到好处。",
        bg_img:require("../img/浣溪沙.jpg"),
    }
})